Repository: OPTIKAL2009/UNO-1
Catalog: locale/*/LC_MESSAGES/*.po
Languages: ru_ru

source: <UnoCard object: {} {}>
ru_ru: <Объект UnoCard: {} {}>

source: Invalid color
ru_ru: Неверный цвет

source: Invalid card type
ru_ru: Неверный тип карты

source: Invalid player: must be initalised with 7 UnoCards
ru_ru: Ошибка инициализации игрока: должен быть создан с 7 UnoCards

source: Invalid player: cards must all be UnoCard objects
ru_ru: Ошибка инициализации игрока: все карты должны быть объектами UnoCard

source: <UnoPlayer object: player {}>
ru_ru: <Объект UnoPlayer: игрок {}>

source: <UnoPlayer object>
ru_ru: Объект UnoPlayer

source: Invalid game: players must be integer
ru_ru: Ошибка игры: количество игроков должно быть задано целым числом

source: Invalid game: must be between 2 and 15 players
ru_ru: Ошибка игры: требуется от 2 до 15 игроков

source: Invalid player: should be the index number
ru_ru: Ошибка игрока: должен быть номер-индекс

source: Invalid player: index out of range
ru_ru: Ошибка игрока: выход за границы массива

source: Invalid player: not their turn
ru_ru: Ошибка игрока: не их ход

source: Invalid card: {} not playable on {}
ru_ru: Неверная карта: {} нельзя сыграть на {}

source: Invalid new_color: must be red, yellow, green or blue
ru_ru: Ошибка new_color: должен быть red, yellow, green или blue

source: Game is over
ru_ru: Игра окончена

source: Player {} wins!
ru_ru: Игрок {} победил!

source: The game begins. You are Player {}.
ru_ru: Игра началась. Вы - игрок {}

source: Current card: {}, color: {}
ru_ru: Текущая карта: {}, цвет: {}

source: Which card do you want to play?
ru_ru: Какую карту Вы хотите сыграть?

source: Cannot play that card
ru_ru: Нельзя сыграть эту карту

source: Which color do you want?
ru_ru: Какой цвет Вы выбераете?

source: You cannot play. You must pick up a card.
ru_ru: Вы не можете ходить. Вы должны взять карту.

source: Player {} played {}
ru_ru: Игрок {} сыграл {}

source: Player {} picked up
ru_ru: Игрок {} взял карту из колоды

source: Your hand: {}
ru_ru: Ваши карты: {}
